requests/seturl.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:r20="http://r200806.ws.fmg.fortinet.com/">
   <soapenv:Header/>
   <soapenv:Body>
      <r20:addPmConfig54AdomObjWebfilterUrlfilterEntries>
         <path>
            <adom>{{ adom }}</adom> 
            <urlfilter>{{ urlfilter }}</urlfilter>
         </path>
         {% for url in urls %}
         <data>
            <url>{{ url }}</url>
            <type>{{ tipo }}</type>
            <action>{{ acao }}</action>
            <status>{{ status }}</status>
         </data>
         {% endfor %}
         <session>{{ sessao }}</session>
      </r20:addPmConfig54AdomObjWebfilterUrlfilterEntries>
   </soapenv:Body>
</soapenv:Envelope>